# Concatenating
Another way to join DataFrames is the concat() function. This function concatenates two DataFrames together.

In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

### Series

In [2]:
ser1 = Series(np.arange(3),
             index=['A','B','C'])

ser1

A    0
B    1
C    2
dtype: int32

In [3]:
ser2 = Series(np.arange(11,13),
             index=['X','Y'])

ser2

X    11
Y    12
dtype: int32

In [4]:
pd.concat([ser1,ser2])

A     0
B     1
C     2
X    11
Y    12
dtype: int32

In [5]:
pd.concat([ser1,ser2],axis=1,sort=False)

     0     1
A  0.0   NaN
B  1.0   NaN
C  2.0   NaN
X  NaN  11.0
Y  NaN  12.0

In [6]:
pd.concat([ser1,ser2],keys=['ser 1','ser 2'])

ser 1  A     0
       B     1
       C     2
ser 2  X    11
       Y    12
dtype: int32

In [7]:
pd.concat([ser1,ser2],ignore_index=True)

0     0
1     1
2     2
3    11
4    12
dtype: int32

### DataFrames

In [8]:
df1 = DataFrame(np.random.randn(4,3),
               columns=['X','Y','Z'])

df1

          X         Y         Z
0 -0.933401 -0.112348  0.467305
1 -0.167886  0.725221  0.746964
2 -0.394241  0.716228 -0.790257
3  0.921349 -0.335139 -0.049431

In [9]:
df2 = DataFrame(np.random.randn(3,3),
               columns=['Y','W','X'])

df2

          Y         W         X
0 -0.766276 -0.199786  0.198715
1  0.070713  0.477270  0.496984
2  1.809823  0.191635 -2.282284

In [10]:
pd.concat([df1,df2],sort=False)

          X         Y         Z         W
0 -0.933401 -0.112348  0.467305       NaN
1 -0.167886  0.725221  0.746964       NaN
2 -0.394241  0.716228 -0.790257       NaN
3  0.921349 -0.335139 -0.049431       NaN
0  0.198715 -0.766276       NaN -0.199786
1  0.496984  0.070713       NaN  0.477270
2 -2.282284  1.809823       NaN  0.191635

In [11]:
pd.concat([df1,df2],sort=False,ignore_index=True)   #default -> join = outer

          X         Y         Z         W
0 -0.933401 -0.112348  0.467305       NaN
1 -0.167886  0.725221  0.746964       NaN
2 -0.394241  0.716228 -0.790257       NaN
3  0.921349 -0.335139 -0.049431       NaN
4  0.198715 -0.766276       NaN -0.199786
5  0.496984  0.070713       NaN  0.477270
6 -2.282284  1.809823       NaN  0.191635

In [12]:
pd.concat([df1,df2],sort=False,ignore_index=True,join='inner')

          X         Y
0 -0.933401 -0.112348
1 -0.167886  0.725221
2 -0.394241  0.716228
3  0.921349 -0.335139
4  0.198715 -0.766276
5  0.496984  0.070713
6 -2.282284  1.809823

## Joining

Another way to join two DataFrames is the join() function. This function is called from the dataframe object itself and joins columns with another DataFrame either on index or on a key column.

In [13]:
df3 = pd.DataFrame({'W': ['W0', 'W1', 'W2'],
                     'X': ['X0', 'X1', 'X2']},
                      index=['I0', 'I1', 'I2']) 

df4 = pd.DataFrame({'Q': ['Q0', 'Q2', 'Q3'],
                    'Y': ['Y0', 'Y2', 'Y3']},
                      index=['I0', 'I2', 'I3'])

In [14]:
df3

     W   X
I0  W0  X0
I1  W1  X1
I2  W2  X2

In [15]:
df4

     Q   Y
I0  Q0  Y0
I2  Q2  Y2
I3  Q3  Y3

In [16]:
df3.join(df4)

     W   X    Q    Y
I0  W0  X0   Q0   Y0
I1  W1  X1  NaN  NaN
I2  W2  X2   Q2   Y2

In [17]:
df3.join(df4, how='inner')

     W   X   Q   Y
I0  W0  X0  Q0  Y0
I2  W2  X2  Q2  Y2